; domain
; source => https://github.com/AI-Planning/pddl-generators/blob/main/spanner/domain.pddl
(define (domain spanner)
(:requirements :typing :strips)
(:types
	location locatable - object
	man nut spanner - locatable
)

(:predicates
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(usable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))

(:action walk
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start)
                           (link ?start ?end))
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l)
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l)
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (usable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (usable ?s)) (tightened ?n)))
)

; problem
(define (problem spanner-84)
 (:domain spanner)
 (:objects 
    bob - man
    spanner1 spanner2 spanner3 spanner4 spanner5 spanner6 spanner7 spanner8 spanner9 - spanner
    nut1 nut2 nut3 nut4 nut5 - nut
    shed location1 location2 location3 location4 location5 location6 location7 location8 location9 gate - location
 )
 (:init 
    (at bob shed)
    (at spanner1 location4)
    (usable spanner1)
    (at spanner2 location6)
    (usable spanner2)
    (at spanner3 location8)
    (usable spanner3)
    (at spanner4 location4)
    (usable spanner4)
    (at spanner5 location7)
    (usable spanner5)
    (at spanner6 location7)
    (usable spanner6)
    (at spanner7 location3)
    (usable spanner7)
    (at spanner8 location4)
    (usable spanner8)
    (at spanner9 location7)
    (usable spanner9)
    (at nut1 gate)
    (loose nut1)
    (at nut2 gate)
    (loose nut2)
    (at nut3 gate)
    (loose nut3)
    (at nut4 gate)
    (loose nut4)
    (at nut5 gate)
    (loose nut5)
    (link shed location1)
    (link location9 gate)
    (link location1 location2)
     (link location2 location3)
     (link location3 location4)
     (link location4 location5)
     (link location5 location6)
     (link location6 location7)
     (link location7 location8)
     (link location8 location9)
 )
 (:goal (and 
(tightened nut1)
(tightened nut2)
))
)

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 2
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 2
3. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 2
4. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 2
5. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 2
6. (walk location5 location6 bob)
   deleted: (at bob location5)
   added: (at bob location6)
   goals met: 0 of 2
7. (walk location6 location7 bob)
   deleted: (at bob location6)
   added: (at bob location7)
   goals met: 0 of 2
8. (pickup_spanner location7 spanner9 bob)
   deleted: (at spanner9 location7)
   added: (carrying bob spanner9)
   goals met: 0 of 2
9. (walk location7 location8 bob)
   deleted: (at bob location7)
   added: (at bob location8)
   goals met: 0 of 2
10. (pickup_spanner location8 spanner3 bob)
   deleted: (at spanner3 location8)
   added: (carrying bob spanner3)
   goals met: 0 of 2
11. (walk location8 location9 bob)
   deleted: (at bob location8)
   added: (at bob location9)
   goals met: 0 of 2
12. (walk location9 gate bob)
   deleted: (at bob location9)
   added: (at bob gate)
   goals met: 0 of 2
13. (tighten_nut gate spanner9 bob nut1)
   deleted: (loose nut1) (usable spanner9)
   added: (tightened nut1)
   goals met: 1 of 2
14. (tighten_nut gate spanner3 bob nut2)
   deleted: (loose nut2) (usable spanner3)
   added: (tightened nut2)
   goals met: 2 of 2
